import React from "react";

const BlogChildContent = () => {
  return (
    <section className="relative w-full bg-[#F3F0E6] flex flex-col items-center px-4 md:px-12 lg:px-[100px] pt-12 md:pt-[80px] pb-8 md:pb-[40px] gap-20 md:gap-[80px] overflow-hidden">
      {/* Intro text */}
      <div className="w-full max-w-4xl text-left z-10">
        <p className="font-inter font-light text-base md:text-lg lg:text-[20px] leading-[1.4] text-black whitespace-pre-line">
          Тргување на берза како начин на инвестирање е многу интересен процес,
          во кој секој инвеститор би требало да научи многу аспекти од
          финансиското работење на секоја компанија во која инвестира.
          {"\n\n"}
          Бев инспириран од прашањето: „Како да купам акции на Македонска
          берза?“ и веднаш ми текна на тоа како јас ги купив моите први акции на
          Македонска берза.
          {"\n\n"}
          Уште се сеќавам на моментот кога својата заштеда ја префрлив на
          сметката со цел да ја направам првата трансакција. Но да почнеме од
          почеток.
        </p>
      </div>
      <div className="w-full max-w-4xl text-left z-10">
        <h2 className="font-lora  lg:text-[32px] leading-[1.4] text-black font-bold pb-8">
          Што се акции?
        </h2>
        <p className="font-inter font-light text-base md:text-lg lg:text-[20px] leading-[1.4] text-black whitespace-pre-line">
          Тргување на берза како начин на инвестирање е многу интересен процес,
          во кој секој инвеститор би требало да научи многу аспекти од
          финансиското работење на секоја компанија во која инвестира.
          {"\n\n"}
          Бев инспириран од прашањето: „Како да купам акции на Македонска
          берза?“ и веднаш ми текна на тоа како јас ги купив моите први акции на
          Македонска берза.
          {"\n\n"}
          Уште се сеќавам на моментот кога својата заштеда ја префрлив на
          сметката со цел да ја направам првата трансакција. Но да почнеме од
          почеток.
        </p>
        <p className="font-inter font-light text-base md:text-lg lg:text-[20px] leading-[1.4] text-black whitespace-pre-line">
          Тргување на берза како начин на инвестирање е многу интересен процес,
          во кој секој инвеститор би требало да научи многу аспекти од
          финансиското работење на секоја компанија во која инвестира.
          {"\n\n"}
          Бев инспириран од прашањето: „Како да купам акции на Македонска
          берза?“ и веднаш ми текна на тоа како јас ги купив моите први акции на
          Македонска берза.
          {"\n\n"}
          Уште се сеќавам на моментот кога својата заштеда ја префрлив на
          сметката со цел да ја направам првата трансакција. Но да почнеме од
          почеток.
        </p>
      </div>
    </section>
  );
};

export default BlogChildContent;
